app/Controllers/Auth.php

SELECT `encrypted`
FROM `office_user`
WHERE `email` = 'rupam@ratepersqft.com'
AND `status` = 1
---
    public function login(){


        $session = session();

        $user = $val = $this->request->getVar('login[username]', FILTER_SANITIZE_STRING);
        $pass = $val = $this->request->getVar('login[password]', FILTER_SANITIZE_STRING);


        $db   = \Config\Database::connect();
        $builder = $db->table('office_user');
        $builder->select('encrypted');

        $builder->where(['email' => $user, 'status' => 1]);
        $query  =$builder->get();

UPDATE `office_user` SET `logged_in` = 1, `logged_session_id` = '1325feqsmvb6vguahekit84rkq2lpv34'
WHERE `id` = '43'
---

                $builder = $db->table('office_user');
                $builder->where("id",  $office_user['userdata'][0]->id);
                $builder->update($dataUser);

INSERT INTO `user_login_activity` (`user_id`, `login_date`, `login_time`, `logged_ip`, `user_agent`, `session_id`) VALUES ('43', '2023-05-20', '11:46:26', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/113.0.0.0 Safari/537.36 Edg/113.0.1774.42', '1325feqsmvb6vguahekit84rkq2lpv34')
---
                $dataUserAct['user_agent']=$_SERVER['HTTP_USER_AGENT'];
                $dataUserAct['session_id']=$dataUser['logged_session_id'];
                $builder = $db->table('user_login_activity');
                $builder->insert($dataUserAct);